app/controllers/line_items_controller.rb

  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)
    respond_to do |format|
      if @line_item.save
---
SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 298486374]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-09-11 08:25:52.445970"], ["updated_at", "2015-09-11 08:25:52.445970"]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "updated_at") VALUES (?, ?, ?, ?)  [["cart_id", 980190963], ["created_at", "2015-09-11 08:25:52.657075"], ["product_id", 298486374], ["updated_at", "2015-09-11 08:25:52.657075"]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = 10  [["quantity", 2], ["updated_at", "2015-09-12 15:25:13.796441"]]