app/controllers/orders_controller.rb

  def new
    @order = Order.new
    if @cart.line_items.empty?
---
SELECT  1 AS one FROM "line_items"  WHERE "line_items"."cart_id" = ? LIMIT 1  [["cart_id", 1]]
SELECT "line_items".* FROM "line_items"  WHERE "line_items"."cart_id" = ?  [["cart_id", 1]]

  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(@cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-09-14 02:51:08.966117"], ["updated_at", "2015-09-14 02:51:08.966117"]]
INSERT INTO "orders" ("address", "created_at", "email", "name", "pay_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["address", "b"], ["created_at", "2015-09-12 21:47:55.327663"], ["email", "a@b.c"], ["name", "a"], ["pay_type", "Check"], ["updated_at", "2015-09-12 21:47:55.327663"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 2]]